#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ["Ivan", "Vika", "Kris"]

# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['Ivan', 194], ['Vika', 168], ['Kris', 177]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
print('High of Ivan = ', 194)

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print (194+168+177)
