#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
<<<<<<< HEAD
my_family = ['Папа', 'Мама', 'Брат']
=======
my_family = ['Мама', 'Папа', 'Я']
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28


# список списков приблизителного роста членов вашей семьи
my_family_height = [
<<<<<<< HEAD
    ['Папа', 180],
    ['Мама', 160],
    ['Брат', 178]
=======
    ['Мама', 158],
    ['Папа', 178],
    ['Я', 172]
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
<<<<<<< HEAD
print('Рост отца -', my_family_height[0][1], 'см')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print('Общий рост моей семьи -', my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1], 'см')
=======
print("Рост отца -", my_family_height[1][1], "см")
# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print("Общий рост моей семьи -", my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1], "см")
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
