#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
<<<<<<< HEAD
<<<<<<< HEAD
my_family = ['Мама', 'Папа', 'Я']
=======
my_family = ['Папа', 'Мама', 'Брат']
>>>>>>> 341e0f52f6cc9049d8719f58db8a521275f5857a
=======
my_family = ['Папа', 'Мама', 'Брат']
=======
my_family = ['Мама', 'Папа', 'Я']
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8


# список списков приблизителного роста членов вашей семьи
my_family_height = [
<<<<<<< HEAD
<<<<<<< HEAD
    ['Мама', 158],
    ['Папа', 178],
    ['Я', 172]
=======
    ['Папа', 180],
    ['Мама', 160],
    ['Брат', 178]
>>>>>>> 341e0f52f6cc9049d8719f58db8a521275f5857a
=======
    ['Папа', 180],
    ['Мама', 160],
    ['Брат', 178]
=======
    ['Мама', 158],
    ['Папа', 178],
    ['Я', 172]
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
<<<<<<< HEAD
<<<<<<< HEAD
print("Рост отца -", my_family_height[1][1], "см")
# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print("Общий рост моей семьи -", my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1], "см")
=======
=======
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8
print('Рост отца -', my_family_height[0][1], 'см')

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print('Общий рост моей семьи -', my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1], 'см')
<<<<<<< HEAD
>>>>>>> 341e0f52f6cc9049d8719f58db8a521275f5857a
=======
=======
print("Рост отца -", my_family_height[1][1], "см")
# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
print("Общий рост моей семьи -", my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1], "см")
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8
