#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

<<<<<<< HEAD
<<<<<<< HEAD
# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье': [
        {"shop": "пятерочка", "price": 9.99},
        {"shop": "ашан", "price": 10.99}
    ],
    'конфеты': [
        {"shop": "магнит", "price": 30.99},
        {"shop": "пятерочка", "price": 32.99}
    ],
    'карамель': [
        {"shop": "магнит", "price": 41.99},
        {"shop": "ашан", "price": 45.99}
    ],
    'пирожное': [
        {"shop": "пятерочка", "price": 59.99},
        {"shop": "магнит", "price": 62.99}
    ]
=======
=======
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье': [
        {"shop": 'пятерочка', "price": 9.99},
        {"shop": 'ашан', "price": 10.99}
    ],
    'конфеты': [
        {"shop": 'магнит', "price": 30.99},
        {"shop": 'пятерочка', "price": 32.99}
    ],
    "карамель": [
        {"shop": 'магнит', "price": 41.99},
        {"shop": 'ашан',"price": 45.99}
    ],
    'пирожное': [
        {"shop": 'пятерочка', "price": 59.99},
        {"shop": 'магнит', "price": 62.99}
    ],
<<<<<<< HEAD
>>>>>>> 341e0f52f6cc9049d8719f58db8a521275f5857a
=======
=======
# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'печенье': [
        {"shop": "пятерочка", "price": 9.99},
        {"shop": "ашан", "price": 10.99}
    ],
    'конфеты': [
        {"shop": "магнит", "price": 30.99},
        {"shop": "пятерочка", "price": 32.99}
    ],
    'карамель': [
        {"shop": "магнит", "price": 41.99},
        {"shop": "ашан", "price": 45.99}
    ],
    'пирожное': [
        {"shop": "пятерочка", "price": 59.99},
        {"shop": "магнит", "price": 62.99}
    ]
>>>>>>> 12eef8ccb11bebf8d2c24e207d99da6575481a28
>>>>>>> 9e4ea4dcc8a4f845909ef8fcd064ff92e9055da8
}
# Указать надо только по 2 магазина с минимальными ценами

